#include "Stdafx.h"

// 1.查找
// 2.排序
// 1.分治处理思想&排序实例
// 归并排序
// 快速排序
// 分治思想及正确性证明
// 2.优先队列【动态集合中快速实现每次取出最性质元素情形】
// 最大堆
// 最小堆
// 3.管理元素的容器
// 动态数组
// 双向链表
// 栈
// 队列
// 4.散列表
// 7.树-二叉树和二叉搜索树
// 8.树-平衡二叉树，即红黑树，与基于红黑树的词典
// 9.树-平衡多叉树，即B树，与数据结构的扩展
// 图
// 图的广度优先搜索
// 图的深度优先搜索
// 图的拓扑排序
// 图的强连通分量
// 有权图求源点到其他点最短路径
// 有权图求点与点间最短路径
// 有权图求最小生成树
// 有权图求最大流问题
// 关于对递归算法的证明
// 关于对迭代算法的证明
// 动态规划思想&实例
// 贪心算法思想&实例
// 线性规划及单纯性算法
// 字符串匹配

// 几何算法
// 斐波那契堆--不做实现，仅分析思想

// 分析运行时间的摊还分析思想--做笔记
// 分析递归式时间的技术--做笔记

